app/controllers/api/v1/authentication_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Abc123"], ["LIMIT", 1]]
---
            def create

                paramUser = params.require(:username)
                paramPassword = params.require(:password)
                user = User.find_by(username: paramUser)