app/controllers/api/v1/books_controller.rb

SELECT  "books".* FROM "books" LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 1]]
---
        def index
          books = Book.limit(limit).offset(params[:offset])

INSERT INTO "authors" ("first_name", "last_name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Siyanat"], ["last_name", "Khan"], ["age", 37], ["created_at", "2023-04-26 11:35:42.421814"], ["updated_at", "2023-04-26 11:35:42.421814"]]
INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "The Martian"], ["author", "Andy Weir"], ["created_at", "2023-04-12 06:28:06.487981"], ["updated_at", "2023-04-12 06:28:06.487981"]]
---
        def create
          author = Author.create!(author_params)
          book = Book.new(book_params.merge(author_id: author.id))

          if book.save